Revit 2027 API
ModelCurveArrArray.Append Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	ModelCurveArray item
)
Public Overridable Sub Append (
	item As ModelCurveArray
)
public:
virtual void Append(
	ModelCurveArray^ item
)
abstract Append :
        item : ModelCurveArray -> unit
override Append :
        item : ModelCurveArray -> unit
Parameters
item ModelCurveArray
See Also
Reference
ModelCurveArrArray Class
Autodesk.Revit.DB Namespace